/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_dollar_q.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyunjoo <hyunjoo@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/06/05 02:50:27 by hyunjoo           #+#    #+#             */
/*   Updated: 2022/06/05 03:18:11 by hyunjoo          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

int ft_dollar_q(void)
{
	int ret;

	ret = g_exit_num;//사실 이게 끝이면 다른것 필요없이 바로 return 가능
	return (ret)
}